# DialogBoxShowingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxShowingEventArgs Properties
DialogBoxShowingEventArgs Class See Also
---
The DialogBoxShowingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |

# See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace